# YOLOv8 🚀 结合 DAAM (跨源特征) + BSPPF (多尺度形变) 的最强变体

# Parameters
nc: 2  # number of classes (请根据你的 CORS-SAR 飞机数据集修改，比如单类飞机则设为 1)
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32

  # 👇 核心创新区 👇
  - [ -1, 3, DAAM, [ 1024 ] ]       # 8: 【加入 DAAM】提取光学与SAR的跨域几何共性
  - [ -1, 1, BSPPF, [ 1024, 5 ] ] # 9: 【加入 BSPPF】处理飞机的多尺度和多变形状

# Head (纯净版 YOLOv8 P3-P5 结构，坚决不用 VSSA)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]        # 12: 恢复官方 C2f

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]        # 15 (P3/8-small): 恢复官方 C2f

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]]        # 18 (P4/16-medium): 恢复官方 C2f

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]       # 21 (P5/32-large): 恢复官方 C2f

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)