# YOLOv8n + DAAM + P2(小目标检测头)

# Parameters
nc: 2
scales:
  n: [0.33, 0.25, 1024]

# Backbone (与之前一致)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2: 这里是 P2 的特征
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4: 这里是 P3 的特征
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]  # 6: 这里是 P4 的特征
  - [-1, 1, Conv, [1024, 3, 2]]# 7-P5/32
  - [-1, 3, DAAM, [1024]]      # 8: DAAM
  - [-1, 1, SPPF, [1024, 5]]   # 9

# Head (修改为 4 尺度输出)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat P4
  - [-1, 3, C2f, [512]]        # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat P3
  - [-1, 3, C2f, [256]]        # 15

  # 👇 --- 增加的 P2 小目标提取层 --- 👇
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone 的 P2 (第 2 层)
  - [-1, 3, C2f, [128]]        # 18: P2 融合后的特征 (极高分辨率)

  # 👇 --- 自底向上融合 --- 👇
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]        # 21: P3

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]        # 24: P4

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]       # 27: P5

  # 👇 --- 检测头改为接收 4 个尺度的特征 --- 👇
  - [[18, 21, 24, 27], 1, Detect, [nc]]  # Detect(P2, P3, P4, P5)