# Ultralytics YOLO 🚀, AGPL-3.0 license

# Parameters
nc: 2  # number of classes
scales:
  # [depth, width, max_channels]
  # 模型缩放参数 定义不同规模模型的参数
  n: [0.33, 0.25, 1024]


# OptiSAR-Net backbone
backbone:
  # [from, repeats, module, args]
  # [输入来源（-1表示上一层）,模块重复次数 ,模块类型 ,模块参数 ]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2 [从上层获取输入, 重复一次, 标准卷积模块, [输出通道数，卷积核大小，步长]]
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]] # [从上层获取输入, 重复三次, C2f, [输出通道数，使用shortcut连接]]

  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]

  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]

  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/3
  - [-1, 3, DAAM, [1024]]# [从上层获取输入, 重复三次, DAAM, [输出通道数]]
  - [-1, 1, BSPPF, [1024, 5]]  # 9 [从上层获取输入, 重复一次, BSPPF, [输出通道数，最大池化核大小]]

# OptiSAR-Net head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # [从上层获取输入, 重复一次, pytorch原生上采样，[不指定输出尺寸, 放大2倍，插值方式]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, VSSA, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, VSSA, [256]]  # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, VSSA, [512]]  # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, VSSA, [1024]]  # 21 (P5/32-large)


  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)