# 极限涨分版：4-Head 极高分辨率 + 噪声纯化架构
nc: 2
scales:
  n: [0.33, 0.25, 1024]

backbone:
  # 恢复标准 Backbone 以完美加载 COCO 预训练权重
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2-P2/4 (极高分辨率特征)
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]  # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]]# 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8-P5/32
  - [-1, 1, DSA_SPPF, [1024]]  # 9: 尾部保留离散池化抓取宏观目标

head:
  # ---- 纯化截断层 ----
  - [2, 1, FPM, [128]]  # 10: 纯化 P2
  - [4, 1, FPM, [256]]  # 11: 纯化 P3
  - [6, 1, FPM, [512]]  # 12: 纯化 P4

  # ---- 下行路径 (Upsampling) ----
  - [9, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, VBOD, [512]]       # 15: P4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, VBOD, [256]]       # 18: P3

  # 【核心插入】：继续上采样到 P2 极高分辨率
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, VBOD, [128]]       # 21: P2 (专杀极小遥感飞机)

  # ---- 上行路径 (Downsampling) ----
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 18], 1, Concat, [1]]
  - [-1, 3, VBOD, [256]]       # 24: P3 最终输出

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, VBOD, [512]]       # 27: P4 最终输出

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, VBOD, [1024]]      # 30: P5 最终输出

  # ---- 4头检测 ----
  - [[21, 24, 27, 30], 1, Detect, [nc]]  # 接收 4 个尺度的特征