# Ultralytics YOLO 🚀, AGPL-3.0 license

# Parameters
nc: 2  # number of classes
scales:
  n: [0.33, 0.25, 1024]

# Aircraft-Specific OptiSAR-Net backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]

  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]

  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]

  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/3
  # 【替换 1】：引入 CAAM 处理十字形特征
  - [-1, 3, CAAM, [1024]]
  # 【替换 2】：引入 LKA-SPPF 重构离散 SAR 特征 (5 为基础池化核)
  - [-1, 1, LKA_SPPF, [1024, 5]]  # 9

# Aircraft-Specific OptiSAR-Net head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  # 【替换 3】：引入 VCAA 滤除机场复杂杂波
  - [-1, 3, VCAA, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, VCAA, [256]]  # 15

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, VCAA, [512]]  # 18

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, VCAA, [1024]]  # 21

  - [[15, 18, 21], 1, Detect, [nc]]